app/controllers/vocabs_controller.rb

  def create
    @vocab = Vocab.new(params[:vocab])
    @vocab.thai.gsub!(" ", "")
    @vocab.english.gsub!(/^[\ ]*|[\ ]*$/, "")
    @vocab.pronunciation.gsub!(/^[\ ]*|[\ ]*$/, "")
    @vocab.example.gsub!(/^[\ ]*|[\ ]*$/, "")


    respond_to do |format|
      if @vocab.save
---
INSERT INTO "vocabs" ("created_at", "example", "updated_at", "done", "english", "thai", "pronunciation") VALUES('2010-10-03 20:34:02', 'asd ad asd', '2010-10-03 20:34:02', 'f', 'dasd asd asd ', 'asdasdadsasd', 'asdas das dasd ')

  def destroy
    respond_to do |format|
      if @vocab.destroy
---
DELETE FROM "vocabs" WHERE "id" = 4

  def index
    @vocabs = Vocab.paginate(:page => params[:page],
    :per_page => VOCABS_PER_PAGE,
    :order => 'created_at DESC',
    :conditions => ['done = ?',  false])
---
SELECT * FROM "vocabs" WHERE (done = 'f') ORDER BY created_at DESC LIMIT 20 OFFSET 0
SELECT count(*) AS count_all FROM "vocabs" WHERE (done = 'f')

  def update
    respond_to do |format|
      if @vocab.update_attributes(params[:vocab])
---
UPDATE "vocabs" SET "english" = 'overloaded, too full', "updated_at" = '2010-04-15 14:37:27' WHERE "id" = 12

  def find_vocab
    @vocab = Vocab.find(params[:id]) if params[:id]
---
SELECT * FROM "vocabs" WHERE (id > 38 and done = 'f') ORDER BY vocabs.id DESC LIMIT 1